Revit 2015 API
TableSectionData.InsertColumn Method (Int32, Boolean)
 Inserts a column data at a specified index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2015. Use InsertColumn(index) instead.")]
public void InsertColumn(
	int nIndex,
	bool bCreateCellData
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2015. Use InsertColumn(index) instead.")> _
Public Sub InsertColumn ( _
	nIndex As Integer, _
	bCreateCellData As Boolean _
)
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2015. Use InsertColumn(index) instead.")]
public:
void InsertColumn(
	int nIndex,
	bool bCreateCellData
)
Parameters
nIndex
Type: System.Int32
 An integer index.
bCreateCellData
Type: System.Boolean
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  nIndex is invalid index.
Autodesk.Revit.Exceptions.InvalidOperationException |  This operation is forbidden for cells in standard schedule body sections.
See Also
TableSectionData Class
InsertColumn Overload
Autodesk.Revit.DB Namespace